Mrklly/source/dimmer_zigbee/stdlib/inc/hc32_adt.h
typedef enum en_adt_hw_cnt
{
    AdtHwCntTimxALowTimxBRise   = 0u,    ///< CHxA端口为低电平时，CHxB端口上采样到上升沿
    AdtHwCntTimxALowTimxBFall   = 1u,    ///< CHxA端口为低电平时，CHxB端口上采样到下降沿
    AdtHwCntTimxAHighTimxBRise  = 2u,    ///< CHxA端口为高电平时，CHxB端口上采样到上升沿
    AdtHwCntTimxAHighTimxBFall  = 3u,    ///< CHxA端口为高电平时，CHxB端口上采样到下降沿
    AdtHwCntTimxBLowTimxARise   = 4u,    ///< CHxB端口为低电平时，CHxA端口上采样到上升沿
    AdtHwCntTimxBLowTimxAFall   = 5u,    ///< CHxB端口为低电平时，CHxA端口上采样到下降沿
    AdtHwCntTimxBHighTimxARise  = 6u,    ///< CHxB端口为高电平时，CHxA端口上采样到上升沿
    AdtHwCntTimxBHighTimxAFall  = 7u,    ///< CHxB端口为高电平时，CHxA端口上采样到下降沿
    AdtHwCntTimTriARise         = 8u,    ///< TIMTRIA端口上采样到上升沿
    AdtHwCntTimTriAFall         = 9u,    ///< TIMTRIA端口上采样到下降沿
    AdtHwCntTimTriBRise         = 10u,   ///< TIMTRIB端口上采样到上升沿
    AdtHwCntTimTriBFall         = 11u,   ///< TIMTRIB端口上采样到下降沿
    AdtHwCntTimTriCRise         = 12u,   ///< TIMTRIC端口上采样到上升沿
    AdtHwCntTimTriCFall         = 13u,   ///< TIMTRIC端口上采样到下降沿
    AdtHwCntTimTriDRise         = 14u,   ///< TIMTRID端口上采样到上升沿
    AdtHwCntTimTriDFall         = 15u,   ///< TIMTRID端口上采样到下降沿
    AdtHwCntAos0                = 16u,   ///< 从AOS来的事件触发0有效
    AdtHwCntAos1                = 17u,   ///< 从AOS来的事件触发1有效
    AdtHwCntAos2                = 18u,   ///< 从AOS来的事件触发2有效
    AdtHwCntAos3                = 19u,   ///< 从AOS来的事件触发3有效
    AdtHwCntMax                 = 20u,
}en_adt_hw_cnt_t;

/**
 ******************************************************************************
 ** \brief ADT端口刹车极性控制
 **
 ** \note
 ******************************************************************************/
typedef enum en_adt_ptbrk_polarity
{
    AdtPtBrkHigh = 0u,       ///< 端口刹车极性高电平有效
    AdtPtBrkLow  = 1u,       ///< 端口刹车极性低电平有效
}en_adt_ptbrk_polarity_t;

/**
 ******************************************************************************
 ** \brief ADT PWM展频计数选择
 **
 ** \note
 ******************************************************************************/
typedef enum en_adt_pwm_dither_type
{
    AdtPwmDitherUnderFlow = 0u,      ///< PWM展频计数下溢出
    AdtPwmDitherOverFlow  = 1u,       ///< PWM展频计数上溢出
}en_adt_pwm_dither_type_t;

/**
 ******************************************************************************
 ** \brief ADT中断类型
 **
 ** \note
 ******************************************************************************/

typedef enum en_adt_irq_type
{
    AdtCMAIrq  = 0u,     ///< 计数匹配A（或捕获输入）中断
    AdtCMBIrq  = 1u,     ///< 计数匹配B（或捕获输入）中断
    AdtCMCIrq  = 2u,     ///< 计数匹配C中断
    AdtCMDIrq  = 3u,     ///< 计数匹配D中断
    AdtOVFIrq  = 6u,     ///< 上溢匹配中断
    AdtUDFIrq  = 7u,     ///< 下溢匹配中断
    AdtDTEIrq  = 8u,     ///< 死区时间错误中断
}en_adt_irq_type_t;

/**
 ******************************************************************************
 ** \brief ADT软件同步配置
 ** \note
 ******************************************************************************/
typedef struct stc_adt_sw_sync
{
    boolean_t               bAdTim4;      ///< Timer 4
    boolean_t               bAdTim5;      ///< Timer 5
    boolean_t               bAdTim6;      ///< Timer 6

}stc_adt_sw_sync_t;

/**
 ******************************************************************************
 ** \brief ADT AOS触发配置
 ** \note
 ******************************************************************************/
typedef struct stc_adt_aos_trig_cfg
{
    en_adt_itrig_iaosxs_t   enAos0TrigSrc;      ///< AOS0触发源选择
    en_adt_itrig_iaosxs_t   enAos1TrigSrc;      ///< AOS1触发源选择
    en_adt_itrig_iaosxs_t   enAos2TrigSrc;      ///< AOS2触发源选择
    en_adt_itrig_iaosxs_t   enAos3TrigSrc;      ///< AOS3触发源选择
}stc_adt_aos_trig_cfg_t;

/**
 ******************************************************************************
 ** \brief ADT 中断触发配置
 ** \note
 ******************************************************************************/
typedef struct stc_adt_irq_trig_cfg
{
    boolean_t   bAdtUnderFlowTrigEn;      ///< 下溢匹配使能触发ADC
    boolean_t   bAdtOverFlowTrigEn;       ///< 上溢匹配使能触发ADC
    boolean_t   bAdtCntMatchDTrigEn;      ///< 计数匹配D使能触发ADC
    boolean_t   bAdtCntMatchCTrigEn;      ///< 计数匹配C使能触发ADC
    boolean_t   bAdtCntMatchBTrigEn;      ///< 计数匹配B使能触发ADC
    boolean_t   bAdtCntMatchATrigEn;      ///< 计数匹配A使能触发ADC
}stc_adt_irq_trig_cfg_t;

/**
 ******************************************************************************
 ** \brief ADT Trig端口配置
 ** \note
 ******************************************************************************/
typedef struct stc_adt_port_trig_cfg
{
    en_adt_ttrig_trigxs_t   enTrigSrc;      ///< 触发源选择
    boolean_t               bFltEn;         ///< 触发源捕获输入滤波使能
    en_adt_fconr_nofick_t   enFltClk;       ///< 滤波采样基准时钟
}stc_adt_port_trig_cfg_t;

/**
 ******************************************************************************
 ** \brief ADT Z相输入屏蔽功能配置
 ** \note
 ******************************************************************************/
typedef struct stc_adt_zmask_cfg
{
    en_adt_gconr_zmsk_t     enZMaskCycle;              ///< Z相输入屏蔽计数周期选择
    boolean_t               bFltPosCntMaksEn;          ///< Z相输入时的屏蔽周期内，位置计数器的清零功能不屏蔽（FALSE）或屏蔽(TRUE)
    boolean_t               bFltRevCntMaksEn;          ///< Z相输入时的屏蔽周期内，公转计数器的计数功能不屏蔽（FALSE）或屏蔽(TRUE)
}stc_adt_zmask_cfg_t;

/**
 ******************************************************************************
 ** \brief ADT TIMxX端口配置
 ** \note
 ******************************************************************************/
typedef struct stc_adt_TIMxX_port_cfg
{
    en_adt_pconr_capc_t     enCap;      ///< 端口功能模式
    boolean_t               bOutEn;     ///< 输出使能
    en_adt_pconr_perc_t     enPerc;     ///< 周期值匹配时端口状态
    en_adt_pconr_cmpc_t     enCmpc;     ///< 比较值匹配时端口状态
    en_adt_pconr_stastps_t  enStaStp;   ///< 计数开始停止端口状态选择
    en_adt_pconr_port_out_t enStaOut;   ///< 计数开始端口输出状态
    en_adt_pconr_port_out_t enStpOut;   ///< 计数停止端口输出状态
    en_adt_pconr_disval_t   enDisVal;   ///< 强制输出无效时输出状态控制
    en_adt_pconr_dissel_t   enDisSel;   ///< 强制输出无效条件选择
    boolean_t               bFltEn;     ///< 端口捕获输入滤波使能
    en_adt_fconr_nofick_t   enFltClk;   ///< 端口滤波采样基准时钟
}stc_adt_CHxX_port_cfg_t;

/**
 ******************************************************************************
 ** \brief ADT刹车端口配置
 ** \note
 ******************************************************************************/
typedef struct stc_adt_break_port_cfg
{
    boolean_t               bPortEn;    ///< 端口使能
    en_adt_ptbrk_polarity_t enPol;      ///< 极性选择
}stc_adt_break_port_cfg_t;

/**
 ******************************************************************************
 ** \brief ADT无效条件3配置
 ** \note
 ******************************************************************************/
typedef struct stc_adt_disable_3_cfg
{
    stc_adt_break_port_cfg_t    stcBrkPtCfg[16];    ///< 刹车端口配置
    boolean_t                   bFltEn;             ///< 刹车端口滤波使能
    en_adt_fconr_nofick_t       enFltClk;           ///< 滤波采样基准时钟
    boolean_t                   bSwBrk;             ///< 软件刹车
}stc_adt_disable_3_cfg_t;

/**
 ******************************************************************************
 ** \brief ADT无效条件1配置
 ** \note
 ******************************************************************************/
typedef struct stc_adt_disable_1_cfg
{
    boolean_t   bTim6OutSH;     ///< TIM6输出同高
    boolean_t   bTim5OutSH;     ///< TIM5输出同高
    boolean_t   bTim4OutSH;     ///< TIM4输出同高
    boolean_t   bTim6OutSL;     ///< TIM6输出同低
    boolean_t   bTim5OutSL;     ///< TIM5输出同低
    boolean_t   bTim4OutSL;     ///< TIM4输出同低
}stc_adt_disable_1_cfg_t;

/**
 ******************************************************************************
 ** \brief ADT PWM展频计数配置
 ** \note
 ******************************************************************************/
typedef struct stc_adt_pwm_dither_cfg
{
    en_adt_pwm_dither_type_t    enAdtPDType;    ///< PWM展频计数选择
    boolean_t   bTimxBPDEn;                     ///< PWM通道B展频使能
    boolean_t   bTimxAPDEn;                     ///< PWM通道A展频使能
}stc_adt_pwm_dither_cfg_t;


/**
 ******************************************************************************
 ** \brief ADT基本计数配置
 ** \note
 ******************************************************************************/
typedef struct stc_adt_basecnt_cfg
{
    en_adt_cnt_mode_t       enCntMode;      ///< 计数模式
    en_adt_cnt_dir_t        enCntDir;       ///< 计数方向
    en_adt_cnt_ckdiv_t      enCntClkDiv;    ///< 计数时钟选择
}stc_adt_basecnt_cfg_t;

/**
 ******************************************************************************
 ** \brief ADT计数状态
 ** \note
 ******************************************************************************/
typedef struct stc_adt_cntstate_cfg
{
    uint16_t         u16Counter;      ///< 当前计数器的计数值
    boolean_t        enCntDir;        ///< 计数方向
    uint8_t          u8ValidPeriod;   ///< 有效周期计数
    boolean_t        bDTEF;           ///< 死区时间错误标志
    boolean_t        bUDFF;           ///< 下溢匹配标志
    boolean_t        bOVFF;           ///< 上溢匹配标志
    boolean_t        bCMDF;           ///< 计数匹配D标志
    boolean_t        bCMCF;           ///< 计数匹配C标志
    boolean_t        bCMBF;           ///< 计数匹配B标志
    boolean_t        bCMAF;           ///< 计数匹配A标志
}stc_adt_cntstate_cfg_t;

/**
 ******************************************************************************
 ** \brief ADT有效计数周期
 ** \note
 ******************************************************************************/
typedef struct stc_adt_validper_cfg
{
    en_adt_vperr_pcnts_t    enValidCnt;     ///< 有效周期选择
    en_adt_vperr_pcnte_t    enValidCdt;     ///< 有效周期计数条件
    boolean_t               bPeriodD;       ///< 通用信号有效周期选择D
    boolean_t               bPeriodC;       ///< 通用信号有效周期选择C
    boolean_t               bPeriodB;       ///< 通用信号有效周期选择B
    boolean_t               bPeriodA;       ///< 通用信号有效周期选择A
}stc_adt_validper_cfg_t;

